In [19]:
import pandas as pd
import numpy as np
import logging
import datetime

In [2]:
df=pd.read_csv("students_data.csv")

In [3]:
df

   StudentID     Name    Citizen Group  Score
0        101    Akash      India     A     85
1        105    Rohit      India     A     78
2        111    Gagan      India     B     92
3        122     Josh    England     A     88
4        125  Chandan      India     B     75
5        130   Ramesh    England     A     91
6        151    Starc  Australia     B     82
7        158  Krishna      India     A     89
8        160    Jugal      India     B     76
9        170  Anushka  Australia     A     90

In [4]:
head_set=df.head(5)

In [5]:
head_set

   StudentID     Name  Citizen Group  Score
0        101    Akash    India     A     85
1        105    Rohit    India     A     78
2        111    Gagan    India     B     92
3        122     Josh  England     A     88
4        125  Chandan    India     B     75

In [11]:
df['Average_score']=df['Score']
avg_score=df.groupby('StudentID')['Average_score'].mean()

In [12]:
avg_score

StudentID
101    85.0
105    78.0
111    92.0
122    88.0
125    75.0
130    91.0
151    82.0
158    89.0
160    76.0
170    90.0
Name: Average_score, dtype: float64

In [13]:
df

   StudentID     Name    Citizen Group  Score  Average_score
0        101    Akash      India     A     85             85
1        105    Rohit      India     A     78             78
2        111    Gagan      India     B     92             92
3        122     Josh    England     A     88             88
4        125  Chandan      India     B     75             75
5        130   Ramesh    England     A     91             91
6        151    Starc  Australia     B     82             82
7        158  Krishna      India     A     89             89
8        160    Jugal      India     B     76             76
9        170  Anushka  Australia     A     90             90

In [16]:
highest= df.loc[df['Score'].idxmax()]

In [17]:
highest

StudentID          111
Name             Gagan
Citizen          India
Group                B
Score               92
Average_score       92
Name: 2, dtype: object

In [32]:
def log_mess(message):
    timestamp=datetime.datetime.now().strftime("%Y-%m-%d %H-%M-%S")
    log_entry=f"{timestamp}-{message}"
    with open("studentsLog.txt",'a') as f:
        f.write(log_entry)

In [33]:
log_mess("Total number of students in dataset")
total=df.shape[0]
log_mess(str(total))

In [34]:
total

10